app/Controllers/Admin/Akademik.php

SELECT *
FROM `kurikulum`
---
    public function kurikulum()
    {
        $model = new KurikulumModel();
        $data['kurikulum'] = $model->findAll();

SELECT *
FROM `kelas`
---
    public function kelas()
    {
        $model = new KelasModel();
        $data['kelas'] = $model->findAll();

SELECT `siswa`.*, `kelas`.`nama_kelas`, `users`.`username`
FROM `siswa`
LEFT JOIN `kelas` ON `kelas`.`id_kelas` = `siswa`.`id_kelas`
LEFT JOIN `users` ON `users`.`id_relasi` = `siswa`.`id_siswa` AND `users`.`role` = "siswa"
SELECT *
FROM `kelas`
---
    public function siswa()
    {
        $model = new SiswaModel();
        $kelasModel = new KelasModel();

        $db = \Config\Database::connect();
        $builder = $db->table('siswa');
        $builder->select('siswa.*, kelas.nama_kelas');
        $builder->join('kelas', 'kelas.id_kelas = siswa.id_kelas', 'left');
        $data['siswa'] = $builder->get()->getResultArray();

        $data['kelas'] = $kelasModel->findAll();

INSERT INTO `siswa` (`id_kelas`, `nama_siswa`, `nis`, `nisn`, `tempat_lahir`, `tanggal_lahir`, `jenis_pendaftaran`, `asal_sd`, `no_ijazah_sd`, `tahun_ijazah_sd`, `no_shun_sd`, `tahun_shun_sd`, `asal_smp_sebelumnya`, `no_ijazah_smp`, `tahun_ijazah_smp`, `no_shun_smp`, `tahun_shun_smp`, `nama_orang_tua`, `pekerjaan_orang_tua`, `penghasilan_orang_tua`, `created_at`, `updated_at`) VALUES (NULL, 'Mustafa Arifin', '12345', '123456789', 'Payakumbuah', '2026-04-01', 'Siswa Baru', 'SDN 01', '123454356', '2019', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'Orang Tua', 'Tani', '13.000.000', '2026-04-01 00:33:37', '2026-04-01 00:33:37')
---
    public function simpan_siswa()
    {
        $model = new SiswaModel();

        $id_kelas = $this->request->getPost('id_kelas');
        $id_kelas = empty($id_kelas) ? null : $id_kelas;

        $data = [
            'id_kelas' => $id_kelas,
            'nama_siswa' => $this->request->getPost('nama_siswa'),
            'nis' => $this->request->getPost('nis'),
            'nisn' => $this->request->getPost('nisn'),
            'tempat_lahir' => $this->request->getPost('tempat_lahir'),
            'tanggal_lahir' => $this->request->getPost('tanggal_lahir'),
            'jenis_pendaftaran' => $this->request->getPost('jenis_pendaftaran'),
            'asal_sd' => $this->request->getPost('asal_sd'),
            'no_ijazah_sd' => $this->request->getPost('no_ijazah_sd'),
            'tahun_ijazah_sd' => $this->request->getPost('tahun_ijazah_sd'),
            'no_shun_sd' => $this->request->getPost('no_shun_sd'),
            'tahun_shun_sd' => $this->request->getPost('tahun_shun_sd'),
            'asal_smp_sebelumnya' => $this->request->getPost('asal_smp_sebelumnya'),
            'no_ijazah_smp' => $this->request->getPost('no_ijazah_smp'),
            'tahun_ijazah_smp' => $this->request->getPost('tahun_ijazah_smp'),
            'no_shun_smp' => $this->request->getPost('no_shun_smp'),
            'tahun_shun_smp' => $this->request->getPost('tahun_shun_smp'),
            'nama_orang_tua' => $this->request->getPost('nama_orang_tua'),
            'pekerjaan_orang_tua' => $this->request->getPost('pekerjaan_orang_tua'),
            'penghasilan_orang_tua' => $this->request->getPost('penghasilan_orang_tua')
        ];
        $model->insert($data);