app/Controllers/Admin/Aplikasi.php

SELECT *
FROM `identitas_sekolah`
 LIMIT 1
---
    public function identitas()
    {
        $model = new IdentitasSekolahModel();
        $data['identitas'] = $model->first();

SELECT *
FROM `menu_eksternal`
---
    public function menu()
    {
        $model = new MenuEksternalModel();
        $data['menu'] = $model->findAll();