app/Controllers/Admin/Aplikasi.php

    public function identitas()
    {
        $model = new IdentitasSekolahModel();
        $data['identitas'] = $model->first();
---
SELECT *
FROM `identitas_sekolah`
 LIMIT 1

    public function update_identitas()
    {
        $model = new IdentitasSekolahModel();
        $identitas = $model->first();
        $id = $identitas ? $identitas['id'] : null;
        $data = [
            'nama_sekolah' => $this->request->getPost('nama_sekolah'),
            'alamat_sekolah' => $this->request->getPost('alamat_sekolah'),
            'nama_dinas' => $this->request->getPost('nama_dinas')
        ];
        $logo = $this->request->getFile('logo_sekolah');
        if ($logo && $logo->isValid() && !$logo->hasMoved()) {
            $newName = $logo->getRandomName();
            $logo->move('uploads/identitas/', $newName);
            $data['logo_sekolah'] = $newName;
        }
        $logoPemda = $this->request->getFile('logo_pemda');
        if ($logoPemda && $logoPemda->isValid() && !$logoPemda->hasMoved()) {
            $newNamePemda = $logoPemda->getRandomName();
            $logoPemda->move('uploads/identitas/', $newNamePemda);
            $data['logo_pemda'] = $newNamePemda;
        }
        if ($id) {
            $model->update($id, $data);
---
SELECT *
FROM `identitas_sekolah`
 LIMIT 1
UPDATE `identitas_sekolah` SET `nama_sekolah` = 'SMKN 1 SUKA MAJU 1', `alamat_sekolah` = 'Pyakumbuh', `nama_dinas` = 'Dinas Pendidikan', `logo_sekolah` = '1775018940_d6dab71a4f2fcb4219c7.png', `updated_at` = '2026-04-01 11:49:00'
WHERE `identitas_sekolah`.`id` IN ('1')

    public function kepsek()
    {
        $model = new IdentitasSekolahModel();
        $data['identitas'] = $model->first();
---
SELECT *
FROM `identitas_sekolah`
 LIMIT 1

    public function menu()
    {
        $model = new MenuEksternalModel();
        $data['menu'] = $model->orderBy('urutan', 'ASC')->findAll();
---
SELECT *
FROM `menu_eksternal`
ORDER BY `urutan` ASC

    public function update_visimisi()
    {
        $model = new IdentitasSekolahModel();
        $identitas = $model->first();
        $id = $identitas ? $identitas['id'] : null;
        $data = ['visi_misi' => $this->request->getPost('visi_misi')];
        if ($id) {
            $model->update($id, $data);
---
SELECT *
FROM `identitas_sekolah`
 LIMIT 1
UPDATE `identitas_sekolah` SET `visi_misi` = '<p><b><u>Visi</u></b></p><p>ini adalah isi dari visi</p><p><b><u>Misi</u></b></p><p>Ini adalah isi dari misi</p>', `updated_at` = '2026-04-01 12:55:49'
WHERE `identitas_sekolah`.`id` IN ('1')

    public function set_kelas()
    {
        $guruModel = new GuruModel();
        $kelasModel = new KelasModel();
        $db = \Config\Database::connect();
        $builder = $db->table('set_kelas_wali');
        $builder->select('set_kelas_wali.*, guru_tendik.nama_lengkap as nama_guru, kelas.nama_kelas');
        $builder->join('guru_tendik', 'guru_tendik.id_guru = set_kelas_wali.id_guru', 'left');
        $builder->join('kelas', 'kelas.id_kelas = set_kelas_wali.id_kelas', 'left');

        $data['set_kelas'] = $builder->get()->getResultArray();
        $data['guru'] = $guruModel->findAll();
        $data['kelas'] = $kelasModel->findAll();
---
SELECT *
FROM `guru_tendik`
SELECT `set_kelas_wali`.*, `guru_tendik`.`nama_lengkap` as `nama_guru`, `kelas`.`nama_kelas`
FROM `set_kelas_wali`
LEFT JOIN `guru_tendik` ON `guru_tendik`.`id_guru` = `set_kelas_wali`.`id_guru`
LEFT JOIN `kelas` ON `kelas`.`id_kelas` = `set_kelas_wali`.`id_kelas`
SELECT *
FROM `kelas`

    public function set_mapel()
    {
        $guruModel = new GuruModel();
        $mapelModel = new MapelModel();
        $kelasModel = new KelasModel();
        $db = \Config\Database::connect();

        $builder = $db->table('set_mapel_guru');
        $builder->select('set_mapel_guru.*, guru_tendik.nama_lengkap as nama_guru, mapel.nama_mapel, kelas.nama_kelas');
        $builder->join('guru_tendik', 'guru_tendik.id_guru = set_mapel_guru.id_guru', 'left');
        $builder->join('mapel', 'mapel.id_mapel = set_mapel_guru.id_mapel', 'left');
        $builder->join('kelas', 'kelas.id_kelas = set_mapel_guru.id_kelas', 'left');

        $data['set_mapel'] = $builder->get()->getResultArray();
        $data['guru'] = $guruModel->findAll();
        $data['mapel'] = $mapelModel->findAll();
        $data['kelas'] = $kelasModel->findAll();
---
SELECT *
FROM `guru_tendik`
SELECT *
FROM `mapel`
SELECT `set_mapel_guru`.*, `guru_tendik`.`nama_lengkap` as `nama_guru`, `mapel`.`nama_mapel`, `kelas`.`nama_kelas`
FROM `set_mapel_guru`
LEFT JOIN `guru_tendik` ON `guru_tendik`.`id_guru` = `set_mapel_guru`.`id_guru`
LEFT JOIN `mapel` ON `mapel`.`id_mapel` = `set_mapel_guru`.`id_mapel`
LEFT JOIN `kelas` ON `kelas`.`id_kelas` = `set_mapel_guru`.`id_kelas`
SELECT *
FROM `kelas`