app/Controllers/Admin/Informasi.php

    public function kategori_berita()
    {
        $model = new KategoriBeritaModel();
        $data['kategori'] = $model->findAll();
---
SELECT *
FROM `kategori_berita`

    public function berita()
    {
        $model = new BeritaModel();
        $katModel = new KategoriBeritaModel();

        $data['berita'] = $model->findAll();
        $data['kategori_list'] = $katModel->findAll();
---
SELECT *
FROM `berita`
SELECT *
FROM `kategori_berita`

    public function simpan_berita()
    {
        $model = new BeritaModel();

        $data = [
            'id_kategori_b'   => $this->request->getPost('id_kategori_b'),
            'judul_berita'    => $this->request->getPost('judul_berita'),
            'isi_berita'      => $this->request->getPost('isi_berita'),
            'status_publish'  => $this->request->getPost('status_publish'),
            'id_user'         => session()->get('id_user')
        ];
---
SELECT *
FROM `berita`

    public function pengumuman()
    {
        $model = new PengumumanModel();
        $katModel = new KategoriPengumModel();

        $data['pengumuman'] = $model->findAll();
---
SELECT *
FROM `pengumuman`