app/Views/layout/backend/sidebar.php

SELECT *
FROM `identitas_sekolah`
 LIMIT 1
---
$role = session()->get('role');

$identitasModel = new \App\Models\IdentitasSekolahModel();
$identitas = $identitasModel->first();