app/Controllers/Guru/Akademik.php

    public function siswa_ajar()
    {
        $db = \Config\Database::connect();
        $id_guru = session()->get('id_relasi');

        $kelas_diajar = $db->table('set_mapel_guru')->where('id_guru', $id_guru)->select('id_kelas')->distinct()->get()->getResultArray();
---
SELECT DISTINCT `id_kelas`
FROM `set_mapel_guru`
WHERE `id_guru` = '2'