app/Controllers/Frontend.php

SELECT *
FROM `berita`
ORDER BY `tanggal_publish` DESC
 LIMIT 3
---
    public function index()
    {
        $identitasModel = new IdentitasSekolahModel();
        $sliderModel = new SliderModel();
        $beritaModel = new BeritaModel();

        $data = [
            'identitas' => $identitasModel->first(),
            'slider'    => $sliderModel->findAll(),
            'berita'    => $beritaModel->orderBy('tanggal_publish', 'DESC')->findAll(3)
        ];