app/Controllers/Frontend.php

    public function index()
    {
        $identitasModel = new IdentitasSekolahModel();
        $sliderModel = new SliderModel();
        $beritaModel = new BeritaModel();
        $pengumumanModel = new PengumumanModel();
        $arsipModel = new SuratKeluarModel();

        $data = [
            'identitas' => $identitasModel->first(),
            'slider'    => $sliderModel->findAll(),
            'berita_terbaru' => $beritaModel->where('status_publish', 'publish')->orderBy('tanggal_publish', 'DESC')->findAll(5),
            'pengumuman_terbaru' => $pengumumanModel->orderBy('created_at', 'DESC')->findAll(5),
            'arsip_terbaru' => $arsipModel->orderBy('tanggal_surat', 'DESC')->findAll(5)
        ];
---
SELECT *
FROM `berita`
WHERE `status_publish` = 'publish'
ORDER BY `tanggal_publish` DESC
 LIMIT 5
SELECT *
FROM `slider`
SELECT *
FROM `pengumuman`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT *
FROM `surat_keluar`
ORDER BY `tanggal_surat` DESC
 LIMIT 5

    public function kurikulum()
    {
        $model = new KurikulumModel();
        $data['kurikulum'] = $model->findAll();
---
SELECT *
FROM `kurikulum`

    public function dokumen()
    {
        $model = new SuratKeluarModel();
        $data['dokumen'] = $model->orderBy('tanggal_surat', 'DESC')->findAll();
---
SELECT *
FROM `surat_keluar`
ORDER BY `tanggal_surat` DESC