app/Views/layout/frontend/header.php

<?php
$identitasModel = new \App\Models\IdentitasSekolahModel();
$identitas = $identitasModel->first();
---
SELECT *
FROM `identitas_sekolah`
 LIMIT 1

$namaFrontend = ($identitas && !empty($identitas['nama_sekolah'])) ? $identitas['nama_sekolah'] : 'SIS Web';

$menuModel = new \App\Models\MenuEksternalModel();
$menuEksternal = $menuModel->orderBy('urutan', 'ASC')->findAll();
---
SELECT *
FROM `menu_eksternal`
ORDER BY `urutan` ASC